/* automatically generated by rust-bindgen 0.65.1 */

pub const NiFpga_Linux: u32 = 1;
pub const NiFpga_Gcc: u32 = 1;
pub const NiFpga_C89: u32 = 1;
pub const NiFpga_C90: u32 = 1;
pub const NiFpga_C94: u32 = 1;
pub const NiFpga_C99: u32 = 1;
pub const NiFpga_C11: u32 = 1;
#[doc = " A boolean value; either NiFpga_False or NiFpga_True."]
pub type NiFpga_Bool = u8;
#[doc = " Represents a false condition."]
pub const NiFpga_False: NiFpga_Bool = 0;
#[doc = " Represents a true condition."]
pub const NiFpga_True: NiFpga_Bool = 1;
#[doc = " Represents the resulting status of a function call through its return value.\n 0 is success, negative values are errors, and positive values are warnings."]
pub type NiFpga_Status = i32;
#[doc = " No errors or warnings."]
pub const NiFpga_Status_Success: NiFpga_Status = 0;
#[doc = " The timeout expired before the FIFO operation could complete."]
pub const NiFpga_Status_FifoTimeout: NiFpga_Status = -50400;
#[doc = " No transfer is in progress because the transfer was aborted by the client.\n The operation could not be completed as specified."]
pub const NiFpga_Status_TransferAborted: NiFpga_Status = -50405;
#[doc = " A memory allocation failed. Try again after rebooting."]
pub const NiFpga_Status_MemoryFull: NiFpga_Status = -52000;
#[doc = " An unexpected software error occurred."]
pub const NiFpga_Status_SoftwareFault: NiFpga_Status = -52003;
#[doc = " A parameter to a function was not valid. This could be a NULL pointer, a bad\n value, etc."]

#[doc = " The selected bitfile requires a driver that could not be loaded or that was\n invalid. Use MAX to install all necessary software to your target. Note that\n if your project includes modules under the chassis item, user-defined\n variables, or references to the Scan Clock Chassis I/O item, you must install\n NI-RIO IO Scan software to the target."]
pub const NiFpga_Status_ChildDeviceNotInserted: NiFpga_Status = -63184;
#[doc = " This remote system does not support connections to other remote systems."]
pub const NiFpga_Status_RemoteTarget: NiFpga_Status = -63187;
#[doc = " The operation is no longer supported."]
pub const NiFpga_Status_DeprecatedFunction: NiFpga_Status = -63188;
#[doc = " The supplied search pattern is invalid."]
pub const NiFpga_Status_InvalidPattern: NiFpga_Status = -63189;
#[doc = " The specified device was not found. Use MAX or System Designer to find the\n proper resource name for the intended device."]
pub const NiFpga_Status_InvalidResourceName: NiFpga_Status = -63192;
#[doc = " The requested feature is not supported."]
pub const NiFpga_Status_FeatureNotSupported: NiFpga_Status = -63193;
#[doc = " The NI-RIO software on the target system is not compatible with this\n software. Upgrade the NI-RIO software on the target system."]
pub const NiFpga_Status_VersionMismatch: NiFpga_Status = -63194;
#[doc = " The handle for device communication is invalid or has been closed. Restart\n the application."]
pub const NiFpga_Status_InvalidSession: NiFpga_Status = -63195;
#[doc = " An invalid attribute has been specified."]
pub const NiFpga_Status_InvalidAttribute: NiFpga_Status = -63196;
#[doc = " An invalid attribute value has been specified."]
pub const NiFpga_Status_InvalidAttributeValue: NiFpga_Status = -63197;
#[doc = " The system has run out of resources. Close a session and retry the operation."]
pub const NiFpga_Status_OutOfHandles: NiFpga_Status = -63198;
#[doc = " The session could not be opened because another session with a different\n bitfile is already open on the device. Close the current session before\n opening another."]
pub const NiFpga_Status_CannotDownloadDifferentBitfile: NiFpga_Status = -63199;
#[doc = " This struct contains information needed to interpret an FXP Type.\n   - `isSigned` tells if the type is signed.\n   - `wordLength` tells us the number of bits used in the type.\n   - `integerWordLength` is the number of bits to shift the binary point to\n     reach the most significant bit.\n\n More information can be found at the following links:\n - http://zone.ni.com/reference/en-XX/help/371361J-01/lvconcepts/numeric_data/\n - http://www.ni.com/newsletter/50303/en/\n - http://digital.ni.com/public.nsf/allkb/346CC529EC1092B3862574FA0053B9B2"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NiFpga_FxpTypeInfo {
    pub isSigned: NiFpga_Bool,
    pub wordLength: u8,
    pub integerWordLength: i16,
}
#[test]
fn bindgen_test_layout_NiFpga_FxpTypeInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NiFpga_FxpTypeInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NiFpga_FxpTypeInfo>(),
        4usize,
        concat!("Size of: ", stringify!(NiFpga_FxpTypeInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<NiFpga_FxpTypeInfo>(),
        2usize,
        concat!("Alignment of ", stringify!(NiFpga_FxpTypeInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isSigned) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NiFpga_FxpTypeInfo),
            "::",
            stringify!(isSigned)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wordLength) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(NiFpga_FxpTypeInfo),
            "::",
            stringify!(wordLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).integerWordLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(NiFpga_FxpTypeInfo),
            "::",
            stringify!(integerWordLength)
        )
    );
}
extern "C" {
    #[doc = " You must call this function before all other function calls. This function\n loads the NiFpga library so that all the other functions will work. If this\n function succeeds, you must call NiFpga_Finalize after all other function\n calls.\n\n @warning This function is not thread safe.\n\n @return result of the call"]
    pub fn NiFpga_Initialize() -> NiFpga_Status;
}
extern "C" {
    #[doc = " You must call this function after all other function calls if\n NiFpga_Initialize succeeds. This function unloads the NiFpga library.\n\n @warning This function is not thread safe.\n\n @return result of the call"]
    pub fn NiFpga_Finalize() -> NiFpga_Status;
}
#[doc = " A handle to an FPGA session."]
pub type NiFpga_Session = u32;
